// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5 / 782 -> 8 / 918 -> 1

int N = 918;
string M = N.ToString();

Console.WriteLine(M[1]);
